Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/packs/PIC32CX2051MTC128_DFP/component/supc.h
/*
 * Component description for SUPC
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-01-19T09:46:50Z */
#ifndef _PIC32CXMTC_SUPC_COMPONENT_H_
#define _PIC32CXMTC_SUPC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SUPC                                         */
/* ************************************************************************** */

/* -------- SUPC_CR : (SUPC Offset: 0x00) ( /W 32) Control Register -------- */
#define SUPC_CR_SHDW_Pos                      _UINT32_(0)                                          /* (SUPC_CR) Shutdown Position */
#define SUPC_CR_SHDW_Msk                      (_UINT32_(0x1) << SUPC_CR_SHDW_Pos)                  /* (SUPC_CR) Shutdown Mask */
#define SUPC_CR_SHDW(value)                   (SUPC_CR_SHDW_Msk & (_UINT32_(value) << SUPC_CR_SHDW_Pos)) /* Assigment of value for SHDW in the SUPC_CR register */
#define SUPC_CR_SHDWEOF_Pos                   _UINT32_(1)                                          /* (SUPC_CR) Shutdown End Of Frame Position */
#define SUPC_CR_SHDWEOF_Msk                   (_UINT32_(0x1) << SUPC_CR_SHDWEOF_Pos)               /* (SUPC_CR) Shutdown End Of Frame Mask */
#define SUPC_CR_SHDWEOF(value)                (SUPC_CR_SHDWEOF_Msk & (_UINT32_(value) << SUPC_CR_SHDWEOF_Pos)) /* Assigment of value for SHDWEOF in the SUPC_CR register */
#define SUPC_CR_VROFF_Pos                     _UINT32_(2)                                          /* (SUPC_CR) Voltage Regulator Off Position */
#define SUPC_CR_VROFF_Msk                     (_UINT32_(0x1) << SUPC_CR_VROFF_Pos)                 /* (SUPC_CR) Voltage Regulator Off Mask */
#define SUPC_CR_VROFF(value)                  (SUPC_CR_VROFF_Msk & (_UINT32_(value) << SUPC_CR_VROFF_Pos)) /* Assigment of value for VROFF in the SUPC_CR register */
#define   SUPC_CR_VROFF_NO_EFFECT_Val         _UINT32_(0x0)                                        /* (SUPC_CR) No effect.  */
#define   SUPC_CR_VROFF_STOP_VREG_Val         _UINT32_(0x1)                                        /* (SUPC_CR) If KEY=0xA5, VROFF asserts the VDDCORE domain reset and stops the voltage regulator.  */
#define SUPC_CR_VROFF_NO_EFFECT               (SUPC_CR_VROFF_NO_EFFECT_Val << SUPC_CR_VROFF_Pos)   /* (SUPC_CR) No effect. Position  */
#define SUPC_CR_VROFF_STOP_VREG               (SUPC_CR_VROFF_STOP_VREG_Val << SUPC_CR_VROFF_Pos)   /* (SUPC_CR) If KEY=0xA5, VROFF asserts the VDDCORE domain reset and stops the voltage regulator. Position  */
#define SUPC_CR_TDXTALSEL_Pos                 _UINT32_(3)                                          /* (SUPC_CR) Timing Domain Slow Clock Selector Position */
#define SUPC_CR_TDXTALSEL_Msk                 (_UINT32_(0x1) << SUPC_CR_TDXTALSEL_Pos)             /* (SUPC_CR) Timing Domain Slow Clock Selector Mask */
#define SUPC_CR_TDXTALSEL(value)              (SUPC_CR_TDXTALSEL_Msk & (_UINT32_(value) << SUPC_CR_TDXTALSEL_Pos)) /* Assigment of value for TDXTALSEL in the SUPC_CR register */
#define   SUPC_CR_TDXTALSEL_RC_Val            _UINT32_(0x0)                                        /* (SUPC_CR) Slow clock of the timing domain is driven by the embedded 32 kHz (typical) RC oscillator.  */
#define   SUPC_CR_TDXTALSEL_XTAL_Val          _UINT32_(0x1)                                        /* (SUPC_CR) Slow clock of the timing domain is driven by the 32.768 kHz crystal oscillator.  */
#define SUPC_CR_TDXTALSEL_RC                  (SUPC_CR_TDXTALSEL_RC_Val << SUPC_CR_TDXTALSEL_Pos)  /* (SUPC_CR) Slow clock of the timing domain is driven by the embedded 32 kHz (typical) RC oscillator. Position  */
#define SUPC_CR_TDXTALSEL_XTAL                (SUPC_CR_TDXTALSEL_XTAL_Val << SUPC_CR_TDXTALSEL_Pos) /* (SUPC_CR) Slow clock of the timing domain is driven by the 32.768 kHz crystal oscillator. Position  */
#define SUPC_CR_KEY_Pos                       _UINT32_(24)                                         /* (SUPC_CR) Password Position */
#define SUPC_CR_KEY_Msk                       (_UINT32_(0xFF) << SUPC_CR_KEY_Pos)                  /* (SUPC_CR) Password Mask */
#define SUPC_CR_KEY(value)                    (SUPC_CR_KEY_Msk & (_UINT32_(value) << SUPC_CR_KEY_Pos)) /* Assigment of value for KEY in the SUPC_CR register */
#define   SUPC_CR_KEY_PASSWD_Val              _UINT32_(0xA5)                                       /* (SUPC_CR) Writing any other value in this field aborts the write operation.  */
#define SUPC_CR_KEY_PASSWD                    (SUPC_CR_KEY_PASSWD_Val << SUPC_CR_KEY_Pos)          /* (SUPC_CR) Writing any other value in this field aborts the write operation. Position  */
#define SUPC_CR_Msk                           _UINT32_(0xFF00000F)                                 /* (SUPC_CR) Register Mask  */


/* -------- SUPC_SMMR : (SUPC Offset: 0x04) (R/W 32) Supply Monitor Mode Register -------- */
#define SUPC_SMMR_VDD3V3SMTH_Pos              _UINT32_(0)                                          /* (SUPC_SMMR) VDD3V3 Supply Monitor Threshold Position */
#define SUPC_SMMR_VDD3V3SMTH_Msk              (_UINT32_(0xF) << SUPC_SMMR_VDD3V3SMTH_Pos)          /* (SUPC_SMMR) VDD3V3 Supply Monitor Threshold Mask */
#define SUPC_SMMR_VDD3V3SMTH(value)           (SUPC_SMMR_VDD3V3SMTH_Msk & (_UINT32_(value) << SUPC_SMMR_VDD3V3SMTH_Pos)) /* Assigment of value for VDD3V3SMTH in the SUPC_SMMR register */
#define SUPC_SMMR_VDD3V3SMSMPL_Pos            _UINT32_(8)                                          /* (SUPC_SMMR) VDD3V3 Supply Monitor Sampling Period Position */
#define SUPC_SMMR_VDD3V3SMSMPL_Msk            (_UINT32_(0x7) << SUPC_SMMR_VDD3V3SMSMPL_Pos)        /* (SUPC_SMMR) VDD3V3 Supply Monitor Sampling Period Mask */
#define SUPC_SMMR_VDD3V3SMSMPL(value)         (SUPC_SMMR_VDD3V3SMSMPL_Msk & (_UINT32_(value) << SUPC_SMMR_VDD3V3SMSMPL_Pos)) /* Assigment of value for VDD3V3SMSMPL in the SUPC_SMMR register */
#define   SUPC_SMMR_VDD3V3SMSMPL_DISABLED_Val _UINT32_(0x0)                                        /* (SUPC_SMMR) VDD3V3 supply monitor is disabled  */
#define   SUPC_SMMR_VDD3V3SMSMPL_ALWAYS_ON_Val _UINT32_(0x1)                                        /* (SUPC_SMMR) Continuous VDD3V3 supply monitoring  */
#define   SUPC_SMMR_VDD3V3SMSMPL_32SLCK_Val   _UINT32_(0x2)                                        /* (SUPC_SMMR) VDD3V3 supply monitor is enabled for 1 period every 32 MD_SLCK periods Energy optimization in Backup mode with VDD3V3 supplied.  */
#define   SUPC_SMMR_VDD3V3SMSMPL_256SLCK_Val  _UINT32_(0x3)                                        /* (SUPC_SMMR) VDD3V3 supply monitor is enabled for 1 period every 256 MD_SLCK periods Energy optimization in Backup mode with VDD3V3 supplied.  */
#define   SUPC_SMMR_VDD3V3SMSMPL_2048SLCK_Val _UINT32_(0x4)                                        /* (SUPC_SMMR) VDD3V3 supply monitor is enabled for 1 period every 2048 MD_SLCK periods Energy optimization in Backup mode with VDD3V3 supplied.  */
#define SUPC_SMMR_VDD3V3SMSMPL_DISABLED       (SUPC_SMMR_VDD3V3SMSMPL_DISABLED_Val << SUPC_SMMR_VDD3V3SMSMPL_Pos) /* (SUPC_SMMR) VDD3V3 supply monitor is disabled Position  */
#define SUPC_SMMR_VDD3V3SMSMPL_ALWAYS_ON      (SUPC_SMMR_VDD3V3SMSMPL_ALWAYS_ON_Val << SUPC_SMMR_VDD3V3SMSMPL_Pos) /* (SUPC_SMMR) Continuous VDD3V3 supply monitoring Position  */
#define SUPC_SMMR_VDD3V3SMSMPL_32SLCK         (SUPC_SMMR_VDD3V3SMSMPL_32SLCK_Val << SUPC_SMMR_VDD3V3SMSMPL_Pos) /* (SUPC_SMMR) VDD3V3 supply monitor is enabled for 1 period every 32 MD_SLCK periods Energy optimization in Backup mode with VDD3V3 supplied. Position  */
#define SUPC_SMMR_VDD3V3SMSMPL_256SLCK        (SUPC_SMMR_VDD3V3SMSMPL_256SLCK_Val << SUPC_SMMR_VDD3V3SMSMPL_Pos) /* (SUPC_SMMR) VDD3V3 supply monitor is enabled for 1 period every 256 MD_SLCK periods Energy optimization in Backup mode with VDD3V3 supplied. Position  */
#define SUPC_SMMR_VDD3V3SMSMPL_2048SLCK       (SUPC_SMMR_VDD3V3SMSMPL_2048SLCK_Val << SUPC_SMMR_VDD3V3SMSMPL_Pos) /* (SUPC_SMMR) VDD3V3 supply monitor is enabled for 1 period every 2048 MD_SLCK periods Energy optimization in Backup mode with VDD3V3 supplied. Position  */
#define SUPC_SMMR_VDD3V3SMRSTEN_Pos           _UINT32_(12)                                         /* (SUPC_SMMR) VDD3V3 Supply Monitor Reset Enable Position */
#define SUPC_SMMR_VDD3V3SMRSTEN_Msk           (_UINT32_(0x1) << SUPC_SMMR_VDD3V3SMRSTEN_Pos)       /* (SUPC_SMMR) VDD3V3 Supply Monitor Reset Enable Mask */
#define SUPC_SMMR_VDD3V3SMRSTEN(value)        (SUPC_SMMR_VDD3V3SMRSTEN_Msk & (_UINT32_(value) << SUPC_SMMR_VDD3V3SMRSTEN_Pos)) /* Assigment of value for VDD3V3SMRSTEN in the SUPC_SMMR register */
#define SUPC_SMMR_VDD3V3SMPWRM_Pos            _UINT32_(13)                                         /* (SUPC_SMMR) VDD3V3 Supply Monitor Power Supply Mode Position */
#define SUPC_SMMR_VDD3V3SMPWRM_Msk            (_UINT32_(0x1) << SUPC_SMMR_VDD3V3SMPWRM_Pos)        /* (SUPC_SMMR) VDD3V3 Supply Monitor Power Supply Mode Mask */
#define SUPC_SMMR_VDD3V3SMPWRM(value)         (SUPC_SMMR_VDD3V3SMPWRM_Msk & (_UINT32_(value) << SUPC_SMMR_VDD3V3SMPWRM_Pos)) /* Assigment of value for VDD3V3SMPWRM in the SUPC_SMMR register */
#define   SUPC_SMMR_VDD3V3SMPWRM_MANUAL_Val   _UINT32_(0x0)                                        /* (SUPC_SMMR) The VDDBU power source selection is controlled by configuring the bit RSTC_MR.PWRSW.  */
#define   SUPC_SMMR_VDD3V3SMPWRM_AUTO_VDD3V3SM_Val _UINT32_(0x1)                                        /* (SUPC_SMMR) The VDDBU power source is VBAT when a VDD3V3 undervoltage is detected by the VDD3V3 supply monitor.  */
#define SUPC_SMMR_VDD3V3SMPWRM_MANUAL         (SUPC_SMMR_VDD3V3SMPWRM_MANUAL_Val << SUPC_SMMR_VDD3V3SMPWRM_Pos) /* (SUPC_SMMR) The VDDBU power source selection is controlled by configuring the bit RSTC_MR.PWRSW. Position  */
#define SUPC_SMMR_VDD3V3SMPWRM_AUTO_VDD3V3SM  (SUPC_SMMR_VDD3V3SMPWRM_AUTO_VDD3V3SM_Val << SUPC_SMMR_VDD3V3SMPWRM_Pos) /* (SUPC_SMMR) The VDDBU power source is VBAT when a VDD3V3 undervoltage is detected by the VDD3V3 supply monitor. Position  */
#define SUPC_SMMR_Msk                         _UINT32_(0x0000370F)                                 /* (SUPC_SMMR) Register Mask  */


/* -------- SUPC_MR : (SUPC Offset: 0x08) (R/W 32) Mode Register -------- */
#define SUPC_MR_LCDOUT_Pos                    _UINT32_(0)                                          /* (SUPC_MR) LCD Voltage Regulator Output Position */
#define SUPC_MR_LCDOUT_Msk                    (_UINT32_(0xF) << SUPC_MR_LCDOUT_Pos)                /* (SUPC_MR) LCD Voltage Regulator Output Mask */
#define SUPC_MR_LCDOUT(value)                 (SUPC_MR_LCDOUT_Msk & (_UINT32_(value) << SUPC_MR_LCDOUT_Pos)) /* Assigment of value for LCDOUT in the SUPC_MR register */
#define SUPC_MR_LCDMODE_Pos                   _UINT32_(4)                                          /* (SUPC_MR) LCD Controller Mode of Operation Position */
#define SUPC_MR_LCDMODE_Msk                   (_UINT32_(0x3) << SUPC_MR_LCDMODE_Pos)               /* (SUPC_MR) LCD Controller Mode of Operation Mask */
#define SUPC_MR_LCDMODE(value)                (SUPC_MR_LCDMODE_Msk & (_UINT32_(value) << SUPC_MR_LCDMODE_Pos)) /* Assigment of value for LCDMODE in the SUPC_MR register */
#define   SUPC_MR_LCDMODE_LCDOFF_Val          _UINT32_(0x0)                                        /* (SUPC_MR) The internal supply source and the external supply source are both deselected (OFF Mode).  */
#define   SUPC_MR_LCDMODE_LCDON_EXTVR_Val     _UINT32_(0x2)                                        /* (SUPC_MR) The external supply source for LCD (VDDLCD) is selected (the embedded LCD voltage regulator is in High-impedance mode).  */
#define   SUPC_MR_LCDMODE_LCDON_INVR_Val      _UINT32_(0x3)                                        /* (SUPC_MR) The internal voltage regulator for VDDLCD is selected (Active mode).  */
#define SUPC_MR_LCDMODE_LCDOFF                (SUPC_MR_LCDMODE_LCDOFF_Val << SUPC_MR_LCDMODE_Pos)  /* (SUPC_MR) The internal supply source and the external supply source are both deselected (OFF Mode). Position  */
#define SUPC_MR_LCDMODE_LCDON_EXTVR           (SUPC_MR_LCDMODE_LCDON_EXTVR_Val << SUPC_MR_LCDMODE_Pos) /* (SUPC_MR) The external supply source for LCD (VDDLCD) is selected (the embedded LCD voltage regulator is in High-impedance mode). Position  */
#define SUPC_MR_LCDMODE_LCDON_INVR            (SUPC_MR_LCDMODE_LCDON_INVR_Val << SUPC_MR_LCDMODE_Pos) /* (SUPC_MR) The internal voltage regulator for VDDLCD is selected (Active mode). Position  */
#define SUPC_MR_CORSMM_Pos                    _UINT32_(6)                                          /* (SUPC_MR) VDDCORE Supply Monitor Output Mode Position */
#define SUPC_MR_CORSMM_Msk                    (_UINT32_(0x1) << SUPC_MR_CORSMM_Pos)                /* (SUPC_MR) VDDCORE Supply Monitor Output Mode Mask */
#define SUPC_MR_CORSMM(value)                 (SUPC_MR_CORSMM_Msk & (_UINT32_(value) << SUPC_MR_CORSMM_Pos)) /* Assigment of value for CORSMM in the SUPC_MR register */
#define   SUPC_MR_CORSMM_NO_EFFECT_Val        _UINT32_(0x0)                                        /* (SUPC_MR) VDDCORE supply monitor output value has no effect. Power-on is performed whatever the value of the supply monitor output.  */
#define   SUPC_MR_CORSMM_VALID_VDD_Val        _UINT32_(0x1)                                        /* (SUPC_MR) VDDCORE supply monitor output value is checked to validate the VDDCORE domain power-on.  */
#define SUPC_MR_CORSMM_NO_EFFECT              (SUPC_MR_CORSMM_NO_EFFECT_Val << SUPC_MR_CORSMM_Pos) /* (SUPC_MR) VDDCORE supply monitor output value has no effect. Power-on is performed whatever the value of the supply monitor output. Position  */
#define SUPC_MR_CORSMM_VALID_VDD              (SUPC_MR_CORSMM_VALID_VDD_Val << SUPC_MR_CORSMM_Pos) /* (SUPC_MR) VDDCORE supply monitor output value is checked to validate the VDDCORE domain power-on. Position  */
#define SUPC_MR_VREGDIS_Pos                   _UINT32_(7)                                          /* (SUPC_MR) Internal VDDCORE Voltage Regulator Disable Position */
#define SUPC_MR_VREGDIS_Msk                   (_UINT32_(0x1) << SUPC_MR_VREGDIS_Pos)               /* (SUPC_MR) Internal VDDCORE Voltage Regulator Disable Mask */
#define SUPC_MR_VREGDIS(value)                (SUPC_MR_VREGDIS_Msk & (_UINT32_(value) << SUPC_MR_VREGDIS_Pos)) /* Assigment of value for VREGDIS in the SUPC_MR register */
#define   SUPC_MR_VREGDIS_INT_VREG_Val        _UINT32_(0x0)                                        /* (SUPC_MR) Internal VDDCORE voltage regulator is enabled.  */
#define   SUPC_MR_VREGDIS_EXT_VREG_Val        _UINT32_(0x1)                                        /* (SUPC_MR) Internal VDDCORE voltage regulator is disabled (external power supply is used).  */
#define SUPC_MR_VREGDIS_INT_VREG              (SUPC_MR_VREGDIS_INT_VREG_Val << SUPC_MR_VREGDIS_Pos) /* (SUPC_MR) Internal VDDCORE voltage regulator is enabled. Position  */
#define SUPC_MR_VREGDIS_EXT_VREG              (SUPC_MR_VREGDIS_EXT_VREG_Val << SUPC_MR_VREGDIS_Pos) /* (SUPC_MR) Internal VDDCORE voltage regulator is disabled (external power supply is used). Position  */
#define SUPC_MR_CORSMRSTEN_Pos                _UINT32_(12)                                         /* (SUPC_MR) VDDCORE Supply Monitor Reset Enable Position */
#define SUPC_MR_CORSMRSTEN_Msk                (_UINT32_(0x1) << SUPC_MR_CORSMRSTEN_Pos)            /* (SUPC_MR) VDDCORE Supply Monitor Reset Enable Mask */
#define SUPC_MR_CORSMRSTEN(value)             (SUPC_MR_CORSMRSTEN_Msk & (_UINT32_(value) << SUPC_MR_CORSMRSTEN_Pos)) /* Assigment of value for CORSMRSTEN in the SUPC_MR register */
#define SUPC_MR_CORSMDIS_Pos                  _UINT32_(13)                                         /* (SUPC_MR) VDDCORE Supply Monitor Disable Position */
#define SUPC_MR_CORSMDIS_Msk                  (_UINT32_(0x1) << SUPC_MR_CORSMDIS_Pos)              /* (SUPC_MR) VDDCORE Supply Monitor Disable Mask */
#define SUPC_MR_CORSMDIS(value)               (SUPC_MR_CORSMDIS_Msk & (_UINT32_(value) << SUPC_MR_CORSMDIS_Pos)) /* Assigment of value for CORSMDIS in the SUPC_MR register */
#define SUPC_MR_IO_BACKUP_ISO_Pos             _UINT32_(14)                                         /* (SUPC_MR) Backup Domain IO Isolation Control Position */
#define SUPC_MR_IO_BACKUP_ISO_Msk             (_UINT32_(0x1) << SUPC_MR_IO_BACKUP_ISO_Pos)         /* (SUPC_MR) Backup Domain IO Isolation Control Mask */
#define SUPC_MR_IO_BACKUP_ISO(value)          (SUPC_MR_IO_BACKUP_ISO_Msk & (_UINT32_(value) << SUPC_MR_IO_BACKUP_ISO_Pos)) /* Assigment of value for IO_BACKUP_ISO in the SUPC_MR register */
#define SUPC_MR_OSCBYPASS_Pos                 _UINT32_(20)                                         /* (SUPC_MR) Slow Crystal Oscillator Bypass Position */
#define SUPC_MR_OSCBYPASS_Msk                 (_UINT32_(0x1) << SUPC_MR_OSCBYPASS_Pos)             /* (SUPC_MR) Slow Crystal Oscillator Bypass Mask */
#define SUPC_MR_OSCBYPASS(value)              (SUPC_MR_OSCBYPASS_Msk & (_UINT32_(value) << SUPC_MR_OSCBYPASS_Pos)) /* Assigment of value for OSCBYPASS in the SUPC_MR register */
#define   SUPC_MR_OSCBYPASS_NO_EFFECT_Val     _UINT32_(0x0)                                        /* (SUPC_MR) No effect. Clock selection depends on the value of the bit SUPC_CR.TDXTALSEL.  */
#define   SUPC_MR_OSCBYPASS_BYPASS_Val        _UINT32_(0x1)                                        /* (SUPC_MR) The slow crystal oscillator is bypassed if SUPC_CR.TDXTALSEL=1. The bit OSCBYPASS must be set prior to setting the bit TDXTALSEL.  */
#define SUPC_MR_OSCBYPASS_NO_EFFECT           (SUPC_MR_OSCBYPASS_NO_EFFECT_Val << SUPC_MR_OSCBYPASS_Pos) /* (SUPC_MR) No effect. Clock selection depends on the value of the bit SUPC_CR.TDXTALSEL. Position  */
#define SUPC_MR_OSCBYPASS_BYPASS              (SUPC_MR_OSCBYPASS_BYPASS_Val << SUPC_MR_OSCBYPASS_Pos) /* (SUPC_MR) The slow crystal oscillator is bypassed if SUPC_CR.TDXTALSEL=1. The bit OSCBYPASS must be set prior to setting the bit TDXTALSEL. Position  */
#define SUPC_MR_KEY_Pos                       _UINT32_(24)                                         /* (SUPC_MR) Password Key Position */
#define SUPC_MR_KEY_Msk                       (_UINT32_(0xFF) << SUPC_MR_KEY_Pos)                  /* (SUPC_MR) Password Key Mask */
#define SUPC_MR_KEY(value)                    (SUPC_MR_KEY_Msk & (_UINT32_(value) << SUPC_MR_KEY_Pos)) /* Assigment of value for KEY in the SUPC_MR register */
#define   SUPC_MR_KEY_PASSWD1_Val             _UINT32_(0x59)                                       /* (SUPC_MR) Modifies the VREGDIS bit. Other bits are not affected.  */
#define   SUPC_MR_KEY_PASSWD_Val              _UINT32_(0xA5)                                       /* (SUPC_MR) Writing any other value in this field aborts the write operation.  */
#define SUPC_MR_KEY_PASSWD1                   (SUPC_MR_KEY_PASSWD1_Val << SUPC_MR_KEY_Pos)         /* (SUPC_MR) Modifies the VREGDIS bit. Other bits are not affected. Position  */
#define SUPC_MR_KEY_PASSWD                    (SUPC_MR_KEY_PASSWD_Val << SUPC_MR_KEY_Pos)          /* (SUPC_MR) Writing any other value in this field aborts the write operation. Position  */
#define SUPC_MR_Msk                           _UINT32_(0xFF1070FF)                                 /* (SUPC_MR) Register Mask  */


