Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/packs/PIC32CX2051MTC128_DFP/component/supc.h
/* -------- SUPC_WUMR : (SUPC Offset: 0x0C) (R/W 32) Wakeup Mode Register -------- */
#define SUPC_WUMR_LPDBCEN0_Pos                _UINT32_(0)                                          /* (SUPC_WUMR) Tamper Enable for WKUPx Pin Position */
#define SUPC_WUMR_LPDBCEN0_Msk                (_UINT32_(0x1) << SUPC_WUMR_LPDBCEN0_Pos)            /* (SUPC_WUMR) Tamper Enable for WKUPx Pin Mask */
#define SUPC_WUMR_LPDBCEN0(value)             (SUPC_WUMR_LPDBCEN0_Msk & (_UINT32_(value) << SUPC_WUMR_LPDBCEN0_Pos)) /* Assigment of value for LPDBCEN0 in the SUPC_WUMR register */
#define SUPC_WUMR_LPDBCEN1_Pos                _UINT32_(1)                                          /* (SUPC_WUMR) Tamper Enable for WKUPx Pin Position */
#define SUPC_WUMR_LPDBCEN1_Msk                (_UINT32_(0x1) << SUPC_WUMR_LPDBCEN1_Pos)            /* (SUPC_WUMR) Tamper Enable for WKUPx Pin Mask */
#define SUPC_WUMR_LPDBCEN1(value)             (SUPC_WUMR_LPDBCEN1_Msk & (_UINT32_(value) << SUPC_WUMR_LPDBCEN1_Pos)) /* Assigment of value for LPDBCEN1 in the SUPC_WUMR register */
#define SUPC_WUMR_LPDBCEN2_Pos                _UINT32_(2)                                          /* (SUPC_WUMR) Tamper Enable for WKUPx Pin Position */
#define SUPC_WUMR_LPDBCEN2_Msk                (_UINT32_(0x1) << SUPC_WUMR_LPDBCEN2_Pos)            /* (SUPC_WUMR) Tamper Enable for WKUPx Pin Mask */
#define SUPC_WUMR_LPDBCEN2(value)             (SUPC_WUMR_LPDBCEN2_Msk & (_UINT32_(value) << SUPC_WUMR_LPDBCEN2_Pos)) /* Assigment of value for LPDBCEN2 in the SUPC_WUMR register */
#define SUPC_WUMR_LPDBCEN3_Pos                _UINT32_(3)                                          /* (SUPC_WUMR) Tamper Enable for WKUPx Pin Position */
#define SUPC_WUMR_LPDBCEN3_Msk                (_UINT32_(0x1) << SUPC_WUMR_LPDBCEN3_Pos)            /* (SUPC_WUMR) Tamper Enable for WKUPx Pin Mask */
#define SUPC_WUMR_LPDBCEN3(value)             (SUPC_WUMR_LPDBCEN3_Msk & (_UINT32_(value) << SUPC_WUMR_LPDBCEN3_Pos)) /* Assigment of value for LPDBCEN3 in the SUPC_WUMR register */
#define SUPC_WUMR_LPDBCEN4_Pos                _UINT32_(4)                                          /* (SUPC_WUMR) Tamper Enable for WKUPx Pin Position */
#define SUPC_WUMR_LPDBCEN4_Msk                (_UINT32_(0x1) << SUPC_WUMR_LPDBCEN4_Pos)            /* (SUPC_WUMR) Tamper Enable for WKUPx Pin Mask */
#define SUPC_WUMR_LPDBCEN4(value)             (SUPC_WUMR_LPDBCEN4_Msk & (_UINT32_(value) << SUPC_WUMR_LPDBCEN4_Pos)) /* Assigment of value for LPDBCEN4 in the SUPC_WUMR register */
#define SUPC_WUMR_FWUPDBC_Pos                 _UINT32_(8)                                          /* (SUPC_WUMR) Force Wake-up Inputs Debouncer Period Position */
#define SUPC_WUMR_FWUPDBC_Msk                 (_UINT32_(0x7) << SUPC_WUMR_FWUPDBC_Pos)             /* (SUPC_WUMR) Force Wake-up Inputs Debouncer Period Mask */
#define SUPC_WUMR_FWUPDBC(value)              (SUPC_WUMR_FWUPDBC_Msk & (_UINT32_(value) << SUPC_WUMR_FWUPDBC_Pos)) /* Assigment of value for FWUPDBC in the SUPC_WUMR register */
#define   SUPC_WUMR_FWUPDBC_IMMEDIATE_Val     _UINT32_(0x0)                                        /* (SUPC_WUMR) Immediate, no debouncing, detected active at least on one Slow Clock edge.  */
#define   SUPC_WUMR_FWUPDBC_3_SK_Val          _UINT32_(0x1)                                        /* (SUPC_WUMR) WKUPx shall be in its active state for at least 3 MD_SLCK periods  */
#define   SUPC_WUMR_FWUPDBC_32_SK_Val         _UINT32_(0x2)                                        /* (SUPC_WUMR) WKUPx shall be in its active state for at least 32 MD_SLCK periods  */
#define   SUPC_WUMR_FWUPDBC_512_SK_Val        _UINT32_(0x3)                                        /* (SUPC_WUMR) WKUPx shall be in its active state for at least 512 MD_SLCK periods  */
#define   SUPC_WUMR_FWUPDBC_4096_SK_Val       _UINT32_(0x4)                                        /* (SUPC_WUMR) WKUPx shall be in its active state for at least 4,096 MD_SLCK periods  */
#define   SUPC_WUMR_FWUPDBC_32768_SK_Val      _UINT32_(0x5)                                        /* (SUPC_WUMR) WKUPx shall be in its active state for at least 32,768 MD_SLCK periods  */
#define SUPC_WUMR_FWUPDBC_IMMEDIATE           (SUPC_WUMR_FWUPDBC_IMMEDIATE_Val << SUPC_WUMR_FWUPDBC_Pos) /* (SUPC_WUMR) Immediate, no debouncing, detected active at least on one Slow Clock edge. Position  */
#define SUPC_WUMR_FWUPDBC_3_SK                (SUPC_WUMR_FWUPDBC_3_SK_Val << SUPC_WUMR_FWUPDBC_Pos) /* (SUPC_WUMR) WKUPx shall be in its active state for at least 3 MD_SLCK periods Position  */
#define SUPC_WUMR_FWUPDBC_32_SK               (SUPC_WUMR_FWUPDBC_32_SK_Val << SUPC_WUMR_FWUPDBC_Pos) /* (SUPC_WUMR) WKUPx shall be in its active state for at least 32 MD_SLCK periods Position  */
#define SUPC_WUMR_FWUPDBC_512_SK              (SUPC_WUMR_FWUPDBC_512_SK_Val << SUPC_WUMR_FWUPDBC_Pos) /* (SUPC_WUMR) WKUPx shall be in its active state for at least 512 MD_SLCK periods Position  */
#define SUPC_WUMR_FWUPDBC_4096_SK             (SUPC_WUMR_FWUPDBC_4096_SK_Val << SUPC_WUMR_FWUPDBC_Pos) /* (SUPC_WUMR) WKUPx shall be in its active state for at least 4,096 MD_SLCK periods Position  */
#define SUPC_WUMR_FWUPDBC_32768_SK            (SUPC_WUMR_FWUPDBC_32768_SK_Val << SUPC_WUMR_FWUPDBC_Pos) /* (SUPC_WUMR) WKUPx shall be in its active state for at least 32,768 MD_SLCK periods Position  */
#define SUPC_WUMR_WKUPDBC_Pos                 _UINT32_(12)                                         /* (SUPC_WUMR) Wake-up Inputs Debouncer Period Position */
#define SUPC_WUMR_WKUPDBC_Msk                 (_UINT32_(0x7) << SUPC_WUMR_WKUPDBC_Pos)             /* (SUPC_WUMR) Wake-up Inputs Debouncer Period Mask */
#define SUPC_WUMR_WKUPDBC(value)              (SUPC_WUMR_WKUPDBC_Msk & (_UINT32_(value) << SUPC_WUMR_WKUPDBC_Pos)) /* Assigment of value for WKUPDBC in the SUPC_WUMR register */
#define   SUPC_WUMR_WKUPDBC_IMMEDIATE_Val     _UINT32_(0x0)                                        /* (SUPC_WUMR) Immediate, no debouncing, detected active at least on one Slow Clock edge.  */
#define   SUPC_WUMR_WKUPDBC_3_SK_Val          _UINT32_(0x1)                                        /* (SUPC_WUMR) WKUPx shall be in its active state for at least 3 MD_SLCK periods  */
#define   SUPC_WUMR_WKUPDBC_32_SK_Val         _UINT32_(0x2)                                        /* (SUPC_WUMR) WKUPx shall be in its active state for at least 32 MD_SLCK periods  */
#define   SUPC_WUMR_WKUPDBC_512_SK_Val        _UINT32_(0x3)                                        /* (SUPC_WUMR) WKUPx shall be in its active state for at least 512 MD_SLCK periods  */
#define   SUPC_WUMR_WKUPDBC_4096_SK_Val       _UINT32_(0x4)                                        /* (SUPC_WUMR) WKUPx shall be in its active state for at least 4,096 MD_SLCK periods  */
#define   SUPC_WUMR_WKUPDBC_32768_SK_Val      _UINT32_(0x5)                                        /* (SUPC_WUMR) WKUPx shall be in its active state for at least 32,768 MD_SLCK periods  */
#define SUPC_WUMR_WKUPDBC_IMMEDIATE           (SUPC_WUMR_WKUPDBC_IMMEDIATE_Val << SUPC_WUMR_WKUPDBC_Pos) /* (SUPC_WUMR) Immediate, no debouncing, detected active at least on one Slow Clock edge. Position  */
#define SUPC_WUMR_WKUPDBC_3_SK                (SUPC_WUMR_WKUPDBC_3_SK_Val << SUPC_WUMR_WKUPDBC_Pos) /* (SUPC_WUMR) WKUPx shall be in its active state for at least 3 MD_SLCK periods Position  */
#define SUPC_WUMR_WKUPDBC_32_SK               (SUPC_WUMR_WKUPDBC_32_SK_Val << SUPC_WUMR_WKUPDBC_Pos) /* (SUPC_WUMR) WKUPx shall be in its active state for at least 32 MD_SLCK periods Position  */
#define SUPC_WUMR_WKUPDBC_512_SK              (SUPC_WUMR_WKUPDBC_512_SK_Val << SUPC_WUMR_WKUPDBC_Pos) /* (SUPC_WUMR) WKUPx shall be in its active state for at least 512 MD_SLCK periods Position  */
#define SUPC_WUMR_WKUPDBC_4096_SK             (SUPC_WUMR_WKUPDBC_4096_SK_Val << SUPC_WUMR_WKUPDBC_Pos) /* (SUPC_WUMR) WKUPx shall be in its active state for at least 4,096 MD_SLCK periods Position  */
#define SUPC_WUMR_WKUPDBC_32768_SK            (SUPC_WUMR_WKUPDBC_32768_SK_Val << SUPC_WUMR_WKUPDBC_Pos) /* (SUPC_WUMR) WKUPx shall be in its active state for at least 32,768 MD_SLCK periods Position  */
#define SUPC_WUMR_LPDBC0_Pos                  _UINT32_(16)                                         /* (SUPC_WUMR) Low-power Debouncer Period of WKUPx Position */
#define SUPC_WUMR_LPDBC0_Msk                  (_UINT32_(0x7) << SUPC_WUMR_LPDBC0_Pos)              /* (SUPC_WUMR) Low-power Debouncer Period of WKUPx Mask */
#define SUPC_WUMR_LPDBC0(value)               (SUPC_WUMR_LPDBC0_Msk & (_UINT32_(value) << SUPC_WUMR_LPDBC0_Pos)) /* Assigment of value for LPDBC0 in the SUPC_WUMR register */
#define   SUPC_WUMR_LPDBC0_DISABLE_Val        _UINT32_(0x0)                                        /* (SUPC_WUMR) Disables the low-power debouncers.  */
#define   SUPC_WUMR_LPDBC0_2_RTCOUT_Val       _UINT32_(0x1)                                        /* (SUPC_WUMR) WKUPx in active state for at least 2 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC0_3_RTCOUT_Val       _UINT32_(0x2)                                        /* (SUPC_WUMR) WKUPx in active state for at least 3 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC0_4_RTCOUT_Val       _UINT32_(0x3)                                        /* (SUPC_WUMR) WKUPx in active state for at least 4 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC0_5_RTCOUT_Val       _UINT32_(0x4)                                        /* (SUPC_WUMR) WKUPx in active state for at least 5 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC0_6_RTCOUT_Val       _UINT32_(0x5)                                        /* (SUPC_WUMR) WKUPx in active state for at least 6 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC0_7_RTCOUT_Val       _UINT32_(0x6)                                        /* (SUPC_WUMR) WKUPx in active state for at least 7 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC0_8_RTCOUT_Val       _UINT32_(0x7)                                        /* (SUPC_WUMR) WKUPx in active state for at least 8 RTCOUTx clock periods  */
#define SUPC_WUMR_LPDBC0_DISABLE              (SUPC_WUMR_LPDBC0_DISABLE_Val << SUPC_WUMR_LPDBC0_Pos) /* (SUPC_WUMR) Disables the low-power debouncers. Position  */
#define SUPC_WUMR_LPDBC0_2_RTCOUT             (SUPC_WUMR_LPDBC0_2_RTCOUT_Val << SUPC_WUMR_LPDBC0_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 2 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC0_3_RTCOUT             (SUPC_WUMR_LPDBC0_3_RTCOUT_Val << SUPC_WUMR_LPDBC0_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 3 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC0_4_RTCOUT             (SUPC_WUMR_LPDBC0_4_RTCOUT_Val << SUPC_WUMR_LPDBC0_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 4 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC0_5_RTCOUT             (SUPC_WUMR_LPDBC0_5_RTCOUT_Val << SUPC_WUMR_LPDBC0_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 5 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC0_6_RTCOUT             (SUPC_WUMR_LPDBC0_6_RTCOUT_Val << SUPC_WUMR_LPDBC0_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 6 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC0_7_RTCOUT             (SUPC_WUMR_LPDBC0_7_RTCOUT_Val << SUPC_WUMR_LPDBC0_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 7 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC0_8_RTCOUT             (SUPC_WUMR_LPDBC0_8_RTCOUT_Val << SUPC_WUMR_LPDBC0_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 8 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC1_Pos                  _UINT32_(19)                                         /* (SUPC_WUMR) Low-power Debouncer Period of WKUPx Position */
#define SUPC_WUMR_LPDBC1_Msk                  (_UINT32_(0x7) << SUPC_WUMR_LPDBC1_Pos)              /* (SUPC_WUMR) Low-power Debouncer Period of WKUPx Mask */
#define SUPC_WUMR_LPDBC1(value)               (SUPC_WUMR_LPDBC1_Msk & (_UINT32_(value) << SUPC_WUMR_LPDBC1_Pos)) /* Assigment of value for LPDBC1 in the SUPC_WUMR register */
#define   SUPC_WUMR_LPDBC1_DISABLE_Val        _UINT32_(0x0)                                        /* (SUPC_WUMR) Disables the low-power debouncers.  */
#define   SUPC_WUMR_LPDBC1_2_RTCOUT_Val       _UINT32_(0x1)                                        /* (SUPC_WUMR) WKUPx in active state for at least 2 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC1_3_RTCOUT_Val       _UINT32_(0x2)                                        /* (SUPC_WUMR) WKUPx in active state for at least 3 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC1_4_RTCOUT_Val       _UINT32_(0x3)                                        /* (SUPC_WUMR) WKUPx in active state for at least 4 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC1_5_RTCOUT_Val       _UINT32_(0x4)                                        /* (SUPC_WUMR) WKUPx in active state for at least 5 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC1_6_RTCOUT_Val       _UINT32_(0x5)                                        /* (SUPC_WUMR) WKUPx in active state for at least 6 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC1_7_RTCOUT_Val       _UINT32_(0x6)                                        /* (SUPC_WUMR) WKUPx in active state for at least 7 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC1_8_RTCOUT_Val       _UINT32_(0x7)                                        /* (SUPC_WUMR) WKUPx in active state for at least 8 RTCOUTx clock periods  */
#define SUPC_WUMR_LPDBC1_DISABLE              (SUPC_WUMR_LPDBC1_DISABLE_Val << SUPC_WUMR_LPDBC1_Pos) /* (SUPC_WUMR) Disables the low-power debouncers. Position  */
#define SUPC_WUMR_LPDBC1_2_RTCOUT             (SUPC_WUMR_LPDBC1_2_RTCOUT_Val << SUPC_WUMR_LPDBC1_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 2 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC1_3_RTCOUT             (SUPC_WUMR_LPDBC1_3_RTCOUT_Val << SUPC_WUMR_LPDBC1_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 3 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC1_4_RTCOUT             (SUPC_WUMR_LPDBC1_4_RTCOUT_Val << SUPC_WUMR_LPDBC1_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 4 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC1_5_RTCOUT             (SUPC_WUMR_LPDBC1_5_RTCOUT_Val << SUPC_WUMR_LPDBC1_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 5 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC1_6_RTCOUT             (SUPC_WUMR_LPDBC1_6_RTCOUT_Val << SUPC_WUMR_LPDBC1_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 6 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC1_7_RTCOUT             (SUPC_WUMR_LPDBC1_7_RTCOUT_Val << SUPC_WUMR_LPDBC1_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 7 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC1_8_RTCOUT             (SUPC_WUMR_LPDBC1_8_RTCOUT_Val << SUPC_WUMR_LPDBC1_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 8 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC2_Pos                  _UINT32_(22)                                         /* (SUPC_WUMR) Low-power Debouncer Period of WKUPx Position */
#define SUPC_WUMR_LPDBC2_Msk                  (_UINT32_(0x7) << SUPC_WUMR_LPDBC2_Pos)              /* (SUPC_WUMR) Low-power Debouncer Period of WKUPx Mask */
#define SUPC_WUMR_LPDBC2(value)               (SUPC_WUMR_LPDBC2_Msk & (_UINT32_(value) << SUPC_WUMR_LPDBC2_Pos)) /* Assigment of value for LPDBC2 in the SUPC_WUMR register */
#define   SUPC_WUMR_LPDBC2_DISABLE_Val        _UINT32_(0x0)                                        /* (SUPC_WUMR) Disables the low-power debouncers.  */
#define   SUPC_WUMR_LPDBC2_2_RTCOUT_Val       _UINT32_(0x1)                                        /* (SUPC_WUMR) WKUPx in active state for at least 2 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC2_3_RTCOUT_Val       _UINT32_(0x2)                                        /* (SUPC_WUMR) WKUPx in active state for at least 3 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC2_4_RTCOUT_Val       _UINT32_(0x3)                                        /* (SUPC_WUMR) WKUPx in active state for at least 4 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC2_5_RTCOUT_Val       _UINT32_(0x4)                                        /* (SUPC_WUMR) WKUPx in active state for at least 5 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC2_6_RTCOUT_Val       _UINT32_(0x5)                                        /* (SUPC_WUMR) WKUPx in active state for at least 6 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC2_7_RTCOUT_Val       _UINT32_(0x6)                                        /* (SUPC_WUMR) WKUPx in active state for at least 7 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC2_8_RTCOUT_Val       _UINT32_(0x7)                                        /* (SUPC_WUMR) WKUPx in active state for at least 8 RTCOUTx clock periods  */
#define SUPC_WUMR_LPDBC2_DISABLE              (SUPC_WUMR_LPDBC2_DISABLE_Val << SUPC_WUMR_LPDBC2_Pos) /* (SUPC_WUMR) Disables the low-power debouncers. Position  */
#define SUPC_WUMR_LPDBC2_2_RTCOUT             (SUPC_WUMR_LPDBC2_2_RTCOUT_Val << SUPC_WUMR_LPDBC2_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 2 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC2_3_RTCOUT             (SUPC_WUMR_LPDBC2_3_RTCOUT_Val << SUPC_WUMR_LPDBC2_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 3 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC2_4_RTCOUT             (SUPC_WUMR_LPDBC2_4_RTCOUT_Val << SUPC_WUMR_LPDBC2_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 4 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC2_5_RTCOUT             (SUPC_WUMR_LPDBC2_5_RTCOUT_Val << SUPC_WUMR_LPDBC2_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 5 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC2_6_RTCOUT             (SUPC_WUMR_LPDBC2_6_RTCOUT_Val << SUPC_WUMR_LPDBC2_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 6 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC2_7_RTCOUT             (SUPC_WUMR_LPDBC2_7_RTCOUT_Val << SUPC_WUMR_LPDBC2_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 7 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC2_8_RTCOUT             (SUPC_WUMR_LPDBC2_8_RTCOUT_Val << SUPC_WUMR_LPDBC2_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 8 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC3_Pos                  _UINT32_(25)                                         /* (SUPC_WUMR) Low-power Debouncer Period of WKUPx Position */
#define SUPC_WUMR_LPDBC3_Msk                  (_UINT32_(0x7) << SUPC_WUMR_LPDBC3_Pos)              /* (SUPC_WUMR) Low-power Debouncer Period of WKUPx Mask */
#define SUPC_WUMR_LPDBC3(value)               (SUPC_WUMR_LPDBC3_Msk & (_UINT32_(value) << SUPC_WUMR_LPDBC3_Pos)) /* Assigment of value for LPDBC3 in the SUPC_WUMR register */
#define   SUPC_WUMR_LPDBC3_DISABLE_Val        _UINT32_(0x0)                                        /* (SUPC_WUMR) Disables the low-power debouncers.  */
#define   SUPC_WUMR_LPDBC3_2_RTCOUT_Val       _UINT32_(0x1)                                        /* (SUPC_WUMR) WKUPx in active state for at least 2 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC3_3_RTCOUT_Val       _UINT32_(0x2)                                        /* (SUPC_WUMR) WKUPx in active state for at least 3 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC3_4_RTCOUT_Val       _UINT32_(0x3)                                        /* (SUPC_WUMR) WKUPx in active state for at least 4 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC3_5_RTCOUT_Val       _UINT32_(0x4)                                        /* (SUPC_WUMR) WKUPx in active state for at least 5 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC3_6_RTCOUT_Val       _UINT32_(0x5)                                        /* (SUPC_WUMR) WKUPx in active state for at least 6 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC3_7_RTCOUT_Val       _UINT32_(0x6)                                        /* (SUPC_WUMR) WKUPx in active state for at least 7 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC3_8_RTCOUT_Val       _UINT32_(0x7)                                        /* (SUPC_WUMR) WKUPx in active state for at least 8 RTCOUTx clock periods  */
#define SUPC_WUMR_LPDBC3_DISABLE              (SUPC_WUMR_LPDBC3_DISABLE_Val << SUPC_WUMR_LPDBC3_Pos) /* (SUPC_WUMR) Disables the low-power debouncers. Position  */
#define SUPC_WUMR_LPDBC3_2_RTCOUT             (SUPC_WUMR_LPDBC3_2_RTCOUT_Val << SUPC_WUMR_LPDBC3_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 2 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC3_3_RTCOUT             (SUPC_WUMR_LPDBC3_3_RTCOUT_Val << SUPC_WUMR_LPDBC3_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 3 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC3_4_RTCOUT             (SUPC_WUMR_LPDBC3_4_RTCOUT_Val << SUPC_WUMR_LPDBC3_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 4 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC3_5_RTCOUT             (SUPC_WUMR_LPDBC3_5_RTCOUT_Val << SUPC_WUMR_LPDBC3_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 5 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC3_6_RTCOUT             (SUPC_WUMR_LPDBC3_6_RTCOUT_Val << SUPC_WUMR_LPDBC3_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 6 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC3_7_RTCOUT             (SUPC_WUMR_LPDBC3_7_RTCOUT_Val << SUPC_WUMR_LPDBC3_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 7 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC3_8_RTCOUT             (SUPC_WUMR_LPDBC3_8_RTCOUT_Val << SUPC_WUMR_LPDBC3_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 8 RTCOUTx clock periods Position  */
#define SUPC_WUMR_LPDBC4_Pos                  _UINT32_(28)                                         /* (SUPC_WUMR) Low-power Debouncer Period of WKUPx Position */
#define SUPC_WUMR_LPDBC4_Msk                  (_UINT32_(0x7) << SUPC_WUMR_LPDBC4_Pos)              /* (SUPC_WUMR) Low-power Debouncer Period of WKUPx Mask */
#define SUPC_WUMR_LPDBC4(value)               (SUPC_WUMR_LPDBC4_Msk & (_UINT32_(value) << SUPC_WUMR_LPDBC4_Pos)) /* Assigment of value for LPDBC4 in the SUPC_WUMR register */
#define   SUPC_WUMR_LPDBC4_DISABLE_Val        _UINT32_(0x0)                                        /* (SUPC_WUMR) Disables the low-power debouncers.  */
#define   SUPC_WUMR_LPDBC4_2_RTCOUT_Val       _UINT32_(0x1)                                        /* (SUPC_WUMR) WKUPx in active state for at least 2 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC4_3_RTCOUT_Val       _UINT32_(0x2)                                        /* (SUPC_WUMR) WKUPx in active state for at least 3 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC4_4_RTCOUT_Val       _UINT32_(0x3)                                        /* (SUPC_WUMR) WKUPx in active state for at least 4 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC4_5_RTCOUT_Val       _UINT32_(0x4)                                        /* (SUPC_WUMR) WKUPx in active state for at least 5 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC4_6_RTCOUT_Val       _UINT32_(0x5)                                        /* (SUPC_WUMR) WKUPx in active state for at least 6 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC4_7_RTCOUT_Val       _UINT32_(0x6)                                        /* (SUPC_WUMR) WKUPx in active state for at least 7 RTCOUTx clock periods  */
#define   SUPC_WUMR_LPDBC4_8_RTCOUT_Val       _UINT32_(0x7)                                        /* (SUPC_WUMR) WKUPx in active state for at least 8 RTCOUTx clock periods  */
#define SUPC_WUMR_LPDBC4_DISABLE              (SUPC_WUMR_LPDBC4_DISABLE_Val << SUPC_WUMR_LPDBC4_Pos) /* (SUPC_WUMR) Disables the low-power debouncers. Position  */
#define SUPC_WUMR_LPDBC4_2_RTCOUT             (SUPC_WUMR_LPDBC4_2_RTCOUT_Val << SUPC_WUMR_LPDBC4_Pos) /* (SUPC_WUMR) WKUPx in active state for at least 2 RTCOUTx clock periods Position  */
