Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/packs/PIC32CX2051MTC128_DFP/component/supc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SUPC register API structure */
typedef struct
{
  __O   uint32_t                       SUPC_CR;            /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  uint32_t                       SUPC_SMMR;          /**< Offset: 0x04 (R/W  32) Supply Monitor Mode Register */
  __IO  uint32_t                       SUPC_MR;            /**< Offset: 0x08 (R/W  32) Mode Register */
  __IO  uint32_t                       SUPC_WUMR;          /**< Offset: 0x0C (R/W  32) Wakeup Mode Register */
  __IO  uint32_t                       SUPC_WUIR;          /**< Offset: 0x10 (R/W  32) Wakeup Inputs Register */
  __I   uint32_t                       SUPC_SR;            /**< Offset: 0x14 (R/   32) Status Register */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       SUPC_EMR;           /**< Offset: 0x1C (R/W  32) Extended Mode Register */
  __IO  uint32_t                       SUPC_BMR;           /**< Offset: 0x20 (R/W  32) Backup Mode Register */
  __I   uint32_t                       SUPC_WUSR;          /**< Offset: 0x24 (R/   32) Wakeup Status Register */
  __O   uint32_t                       SUPC_IER;           /**< Offset: 0x28 ( /W  32) Enable Interrupt Register */
  __O   uint32_t                       SUPC_IDR;           /**< Offset: 0x2C ( /W  32) Disable Interrupt Register */
  __I   uint32_t                       SUPC_IMR;           /**< Offset: 0x30 (R/   32) Mask Interrupt Register */
  __I   uint32_t                       SUPC_ISR;           /**< Offset: 0x34 (R/   32) Status Interrupt Register */
} supc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CXMTC_SUPC_COMPONENT_H_ */
